Tekla Open API Reference for Tekla Structures 2025
RebarGuideline.Spacing Property
 Gets or sets the RebarSpacing along the rebar guideline.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public RebarSpacing Spacing { get; set; }
Public Property Spacing As RebarSpacing
	Get
	Set
Property Value
Type: RebarSpacing
See Also
Reference
RebarGuideline Class
Tekla.Structures.Model Namespace